Autodesk.Revit.DB.Analysis.ConceptualConstructionType.IsValidSubcategoryForMassSurfaceDatas(Autodesk.Revit.DB.ElementId)
Validate if a subcategory is appropriate for assignment to Massing surfaces (MassSurfaceData).
This is the list of acceptable values:
OST_MassInteriorWallOST_MassExteriorWallOST_MassExteriorWallUndergroundOST_MassRoofOST_MassFloorOST_MassSlabOST_MassShadeOST_MassGlazingOST_MassSkylightsOST_MassOpening
Remarks:
This excludes sub-categories which are not actually sub-categories that
can be assigned to surfaces, such as OST_MassWallsAll for example.
massSubCategoryId:
The mass sub-category to be checked.
Returns:
True if the mass sub-category falls within the list, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.GetGBSId(Autodesk.Revit.DB.ElementId)
Gets the Green Building Studio identifier associated with the construction.
Remarks:
Sometimes the GBSId is different for the same ConceptualConstructionType depending on the
mass subcategory it is related to.  This is usually the case, for example, for window and skylight
constructions, which do not share GBSid's even when they share ConceptualConstructionTypes.
massSurfaceSubCategoryId:
The ElementId of a valid Mass subcategory of a MassSurfaceData.
Returns:
Returns the integer id used to represent the ConceptualConstructionType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input Element massSurfaceSubCategoryId is not a valid subcategory value for MassSurfaceData.
-or-
The ElementId massSurfaceSubCategoryId is not appropriate for this ConceptualConstructionType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.IsValidConceptualConstructionIdForCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Indicate if a ConceptualConstruction is appropriate to assign to a MassSurfaceData of a particular Mass subcategory.
ccda:
The document.
constructionTypeId:
The ElementId of the ConceptualConstructionType.
massSubcategoryId:
The ElementId of the Mass subcategory.
Returns:
Returns true if valid, false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId constructionTypeId is not an id of a ConceptualConstructionType.
-or-
The mass sub-category is none of the
OST_MassInteriorWall,
OST_MassExteriorWall,
OST_MassExteriorWallUnderground,
OST_MassWallsAll,
OST_MassRoof,
OST_MassFloor,
OST_MassSlab,
OST_MassFloorsAll,
OST_MassShade,
OST_MassGlazing,
OST_MassSkylights,
OST_MassGlazingAll
or OST_MassOpening.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.IsValidSurfaceSubcategoryForConstruction(Autodesk.Revit.DB.ElementId)
Indicates if this ConceptualConstructionType is appropriate for the input MassSurfaceData subcategory.
massSurfaceSubcategoryId:
The ElementId of a Mass subcategory of a MassSurfaceData.
Returns:
Returns true if appropriate for the input subcategory, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input Element massSurfaceSubcategoryId is not a valid subcategory value for MassSurfaceData.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.IsValidConceptualConstructionId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates if the ElementId is an id of a ConceptualConstructionType.
ccda:
The document.
constructionTypeId:
The ElementId of the ConceptualConstructionType.
Returns:
Returns true if is an id of a ConceptualConstructionType, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.GetAllConceptualConstructionsForCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Get all the ids of constructions applicable to the input massSubCategory
ccda:
The document.
massSubCategoryId:
The ElementId of the mass subcategory.
Returns:
Returns a set of ElementIds that for the ConceptualConstructionTypes that are appropriate for the subcategory.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The mass sub-category is none of the
OST_MassInteriorWall,
OST_MassExteriorWall,
OST_MassExteriorWallUnderground,
OST_MassWallsAll,
OST_MassRoof,
OST_MassFloor,
OST_MassSlab,
OST_MassFloorsAll,
OST_MassShade,
OST_MassGlazing,
OST_MassSkylights,
OST_MassGlazingAll
or OST_MassOpening.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.GetOpeningConstructionType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.ConceptualConstructionOpeningType)
Get an Opening ConceptualConstructionType by its ConceptualConstructionOpeningType.
ccda:
The Document.
typeEnum:
The ConceptualConstructionOpeningType to get the ConceptualConstructionType for.
Returns:
Returns ElementId of a ConceptualConstructionType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The enum is invalid for ConceptualConstructionOpeningType.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.GetShadeConstructionType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.ConceptualConstructionShadeType)
Get a Shade ConceptualConstructionType by its ConceptualConstructionShadeType.
ccda:
The Document.
typeEnum:
The ConceptualConstructionShadeType to get the ConceptualConstructionType for.
Returns:
Returns ElementId of a ConceptualConstructionType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The enum is invalid for ConceptualConstructionShadeType.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.GetWindowOrSkylightConstructionType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType)
Get a Window or Skylight ConceptualConstructionType by its ConceptualConstructionWindowSkylightType.
ccda:
The Document.
typeEnum:
The ConceptualConstructionWindowSkylightType to get the ConceptualConstructionType for.
Returns:
Returns ElementId of a ConceptualConstructionType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The enum is invalid for ConceptualConstructionWindowSkylightType.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.GetFloorOrSlabConstructionType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType)
Get a Floor or Slab ConceptualConstructionType by its ConceptualConstructionFloorSlabType.
ccda:
The Document.
typeEnum:
The ConceptualConstructionFloorSlabType to get the ConceptualConstructionType for.
Returns:
Returns ElementId of a ConceptualConstructionType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The enum is invalid for ConceptualConstructionFloorSlabType.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.GetRoofConstructionType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType)
Get a Roof ConceptualConstructionType by its ConceptualConstructionRoofType.
ccda:
The Document.
typeEnum:
The ConceptualConstructionRoofType to get the ConceptualConstructionType for.
Returns:
Returns ElementId of a ConceptualConstructionType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The enum is invalid for ConceptualConstructionRoofType.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.GetWallConstructionType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType)
Get a Wall ConceptualConstructionType by its ConceptualConstructionWallType.
ccda:
The Document.
typeEnum:
The ConceptualConstructionWallType to get the ConceptualConstructionType for.
Returns:
Returns ElementId of a ConceptualConstructionType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The enum is invalid for ConceptualConstructionWallType.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.MassSurfaceSubCategoryId
The surface type subcategory element id associated with the ConceptualConstructionType.
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType.MaterialId
Material used for visualization of this construction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element materialId is not a material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionType
This element is used to describe the conceptual physical, construction, and energy properties in a manner
that can be understood by both the Revit BIM model and Green Building Studio/Green Building XML.
For serialization
Since:
2012